/* Cобственный заголовочный файл */
#include "head_lb5.h"

int main() {
    /******************************* Задание 1 ***************************************/
    std::cout << "\tЗадание 1\n";
    outputTaskOne();
    /******************************* Задание 2 ***************************************/
    std::cout << "\tЗадание 2\n";
    outputTask2();
    /******************************* Задание 3 ***************************************/
    std::cout << "\tЗадание 3\n";
    outputTaskThree();


    return 0;
}
