/*
* Лабораторная работа No5
* Исследование функций С++ в IDE
* (интегрированной среде разработки) Qt Creator
*
*
* "Указатели, ссылки, ветвление С++"
* Типы данных
* Developer: Mochalov E.
*/
/*==========================================================================*/
/* INCLUDE LIBS */
/*==========================================================================*/
/* Cобственный заголовочный файл */
#include "head_lb5.h"

int main() {
    /******************************* Задание 1 ***************************************/
    std::cout << "\tЗадание 1\n";
    outputTaskOne();
    /******************************* Задание 2 ***************************************/
    std::cout << "\tЗадание 2\n";
    outputTask2();
    /******************************* Задание 3 ***************************************/
    std::cout << "\tЗадание 3\n";
    outputTaskThree();
    /******************************* Задание 4 ***************************************/
    std::cout << "\tЗадание 4\n";
    outputTaskFour();
    /******************************* Задание 6 ***************************************/
    std::cout << "\tЗадание 6\n";
    outpuSix();
    /******************************* Задание 7 ***************************************/
    std::cout << "\tЗадание 7\n\n";
    outputTaskSeven();
    /******************************* Задание 8 ***************************************/
    std::cout << "\tЗадание 8\n\n";
    outputTaskEight();
    return 0;
}
    return 0;
}
