/* Подключаем библиотеку для ввода/вывода */
#include <iostream>
/* Подключаем библиотеку для printf */
#include <stdio.h>
/* Пространство имен std */
using namespace std;
/* Глобальные переменные */
int global, global1;

/*  точка входа
*   main - главная функция с которой начинается исполнение программы
*/
int main()
{
    //Тело программы
    /* использование std::cout только в С++ */
    //std::cout << "Мудр - кто знает нужное, а не многое" << std::endl;
    //при использовании пространства имен не обязательно указывать \
    std::

    // TODO здесь используется без std

    cout << "Мудр - кто знает нужное, а не многое" << endl;
    // перевод каретки на следующую строку
    std::cout << std::endl;
    //Результат выполнения программы
    return 0;
}
